# Project 3 Part 3: Creating MySQL DataBase 
---

Author: Jackson Muehlbauer

Date: 3/4/23

In [30]:
# imports 
import pandas as pd
import numpy as np
import json
import matplotlib.pyplot as plt
import seaborn as sns

# MySQL
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

In [3]:
# load data

basics = pd.read_csv('Data/title_basics.csv.gz')
ratings = pd.read_csv('Data/title_ratings.csv.gz')
results = pd.read_csv('Data/tmdb_results_combined.csv.gz')

## Normalizing Genres

- convert single string of genres from title basics to two tables
    1. title_genres (joiner table)
        - tconst
        - genre_id
    2. genres
        - genre_id
        - genre_name

### 1. Getting list of unique genres

In [4]:
# Checking genres column
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

genres is a string of genres separated by a comma

In [6]:
# make genre list column
basics['genres_list'] = basics['genres'].str.split(',')
basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_list
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]

In [7]:
# explode genres_list column
temp_df = basics.explode('genres_list', ignore_index = True)
temp_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_list
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
1,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
2,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
3,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
4,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama

In [8]:
# Get list of unique genres
unique_genres = sorted(temp_df['genres_list'].unique())
print(unique_genres)

['Action', 'Adult', 'Adventure', 'Animation', 'Biography', 'Comedy', 'Crime', 'Drama', 'Family', 'Fantasy', 'Game-Show', 'History', 'Horror', 'Music', 'Musical', 'Mystery', 'News', 'Reality-TV', 'Romance', 'Sci-Fi', 'Short', 'Sport', 'Talk-Show', 'Thriller', 'War', 'Western']

### 2. Create a new title_genres table

In [9]:
# save just tconst and genres_list column
title_genres = temp_df[['tconst', 'genres_list']].copy()
title_genres.head()

      tconst genres_list
0  tt0035423      Comedy
1  tt0035423     Fantasy
2  tt0035423     Romance
3  tt0062336       Drama
4  tt0069049       Drama

### 3. Create a genre mapper dictionary to replace string genres with integers

In [10]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

### 4. Replace the string genres in "title_genres" with the new integer ids

In [12]:
# add genre int to title_genres and drop string genre
title_genres['genre_id'] = title_genres['genres_list'].map(genre_map)
title_genres = title_genres.drop(columns = ['genres_list'])
title_genres.head()

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [15]:
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

### 5. Convert dictionary map into dataframe

In [40]:
# converting genre map into dataframe
genres = pd.DataFrame({'genre_id' : genre_map.values(), 'genre_name' : genre_map.keys()})
genres.head()

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

## Saving the MySQL tables with tconst as the primary key

In [25]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "root"
db_name = "movies"
connection_str = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [22]:
## Check if database exists, if not, create it
if database_exists(connection_str):
    print('It exists!')
else:
    create_database(connection_str)
    print('Database created!')

Database created!

In [26]:
# connect to engine
engine = create_engine(connection_str)

In [28]:
# getting column names from each DataFrame
print(basics.columns, '\n')
print(ratings.columns, '\n')
print(results.columns)

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres', 'genres_list'],
      dtype='object')

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

Index(['imdb_id', 'adult', 'backdrop_path', 'belongs_to_collection', 'budget',
       'genres', 'homepage', 'id', 'original_language', 'original_title',
       'overview', 'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'video',
       'vote_average', 'vote_count', 'certification'],
      dtype='object')

In [31]:
# Cleaning up dataframes
title_basics = basics[['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes']].copy()
title_ratings = ratings[['tconst', 'averageRating', 'numVotes']].copy()
tmdb_data = results[['imdb_id', 'revenue', 'budget', 'certification']].copy()

In [33]:
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1952
1  tt0000002            5.8       264
2  tt0000005            6.2      2589
3  tt0000006            5.1       177
4  tt0000007            5.4       812

In [34]:
tmdb_data.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

In [45]:
# duplicated row in tmdb_data
print(tmdb_data.duplicated().sum())
tmdb_data.drop_duplicates(inplace = True)
print(tmdb_data.duplicated().sum())

1
0

In [56]:
# first row in tmdb_data is empty
display(tmdb_data.head(2))
tmdb_data.drop([0], axis = 0, inplace = True)
display(tmdb_data.head(2))

     imdb_id  revenue      budget certification
0          0      NaN         NaN           NaN
1  tt0113026      0.0  10000000.0           NaN

     imdb_id  revenue      budget certification
1  tt0113026      0.0  10000000.0           NaN
2  tt0113092      0.0         0.0           NaN

In [57]:
# Making schema dictionaries

# FOR title_basics
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## schema
basics_schema = {
    'tconst' : String(key_len+1),
    'primaryTitle' : Text(title_len+1),
    'startYear' : Float(),
    'runtimeMinutes' : Float()
}

# FOR title_ratings
key_len = title_ratings['tconst'].fillna('').map(len).max()
## schema
ratings_schema = {
    'tconst' : String(key_len+1),
    'averageRating' : Float(),
    'numVotes' : Float()
}

# FOR tmdb_data
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()
## schema
tmdb_schema = {
    'imdb_id' : String(key_len+1),
    'revenue' : Float(),
    'budget' : Float(),
    'certification' : Text(cert_len+1)
}

# FOR genres
name_len = genres['genre_name'].fillna('').map(len).max()
## schema
genres_schema = {
    'genre_id' : Integer(),
    'genre_name' : Text(name_len+1)
}

# FOR title_genres
title_len = title_genres['tconst'].fillna('').map(len).max()
tg_schema = {
    'tconst' : Text(title_len+1),
    'genre_id': Integer()
}

In [58]:
# Adding tables to database
title_basics.to_sql('title_basics', engine, dtype = basics_schema, if_exists = 'replace', index = False)
title_ratings.to_sql('title_ratings', engine, dtype = ratings_schema, if_exists = 'replace', index = False)
tmdb_data.to_sql('tmdb_data', engine, dtype = tmdb_schema, if_exists = 'replace', index = False)
title_genres.to_sql('title_genres', engine, dtype = tg_schema, if_exists = 'replace', index = False)
genres.set_index('genre_id').to_sql('genres', engine, dtype = genres_schema ,if_exists = 'replace', index = True)

26

In [59]:
# Add primary keys to each table
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [60]:
# Show first 5 entries in title_basics
q = """SELECT * FROM title_basics LIMIT 5"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118.0
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70.0
2,tt0069049,The Other Side of the Wind,2018.0,122.0
3,tt0088751,The Naked Monster,2005.0,100.0
4,tt0096056,Crime and Punishment,2002.0,126.0

In [61]:
# Show first 5 entries in title_ratings
q = """SELECT * FROM title_ratings LIMIT 5"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7    1952.0
1  tt0000002            5.8     264.0
2  tt0000005            6.2    2589.0
3  tt0000006            5.1     177.0
4  tt0000007            5.4     812.0

In [62]:
# Show first 5 entries in tmdb_data
q = """SELECT * FROM tmdb_data LIMIT 5"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

In [63]:
# Show first 5 entries in genres
q = """SELECT * FROM genres LIMIT 5"""
pd.read_sql(q, engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [64]:
# Show first 5 entries in title_genres
q = """SELECT * FROM title_genres LIMIT 5"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [66]:
# Show tables
q = """SHOW TABLES"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data